app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "STA"], ["room_number", 123]]
---
  def create
    @school_class = SchoolClass.new
    @school_class.title = class_params[:title]
    @school_class.room_number = class_params[:room_number]
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_class
    @school_class = SchoolClass.find(params[:id])