app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Jessica"], ["last_name", "Auz"], ["created_at", "2020-04-28 21:29:19.730540"], ["updated_at", "2020-04-28 21:29:19.730540"]]
---
  def create
    @student = Student.new
    @student.first_name = student_params[:first_name]
    @student.last_name = student_params[:last_name]
    @student.save

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Bryan"], ["updated_at", "2020-04-28 21:33:38.796452"], ["id", 5]]
---
  def update
    find_student
    @student.update(student_params)